app/controllers/school_classes_controller.rb

    def update
        @schoolclass.update(schoolclass_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 905], ["updated_at", "2021-02-06 18:52:26.924310"], ["id", 1]]