app/controllers/students_controller.rb

    def update
        @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Banananut"], ["updated_at", "2021-02-06 18:38:38.239203"], ["id", 8]]